package by.academy.cw.cw2.arrays;

public class Task11 {
//    Пользователь должен указать с клавиатуры чётное положительное число,
//а программа должна создать массив указанного размера из случайных целых чисел из
// [-5;5] и вывести его на экран в строку.
//После этого программа должна определить и сообщить пользователю о том,
// сумма модулей какой половины массива больше:
//левой или правой, либо сообщить, что эти суммы модулей равны.
//Если пользователь введёт неподходящее число, то программа должна
// требовать повторного ввода до тех пор, пока не будет указано корректное значение.


}
